In [2]:
import pandas as pd

In [16]:
df = pd.DataFrame({'A':[1,2,3], 'B': [4,5,6], 'C':[7,8,9]})
df

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [17]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [14]:
# ghi de
# ap dung ca index va column
df.index = ['V', 3, 4.3]
df.columns = ['ABCX', 4, 55.54]
df

     ABCX  4  55.54
V       1  2      2
3       2  3      1
4.3     3  1      3

In [18]:
df.columns

Index(['A', 'B', 'C'], dtype='object')

In [20]:
# xem thong tin df
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
A    3 non-null int64
B    3 non-null int64
C    3 non-null int64
dtypes: int64(3)
memory usage: 152.0 bytes

In [25]:
df.head(2)

   A  B  C
0  1  4  7
1  2  5  8

In [22]:
df.shape

(3, 3)

In [24]:
df.describe()

         A    B    C
count  3.0  3.0  3.0
mean   2.0  5.0  8.0
std    1.0  1.0  1.0
min    1.0  4.0  7.0
25%    1.5  4.5  7.5
50%    2.0  5.0  8.0
75%    2.5  5.5  8.5
max    3.0  6.0  9.0

In [26]:
# lay cot cu the
df['A']

0    1
1    2
2    3
Name: A, dtype: int64

In [29]:
a = ['A', 'B']
df[a]

   A  B
0  1  4
1  2  5
2  3  6

In [34]:
# lay thong tin cot thoa man
df[df.A == 1]

   A  B  C
0  1  4  7

In [35]:
df.A

0    1
1    2
2    3
Name: A, dtype: int64

In [38]:
# sapxep
df.sort_values('A', ascending=False)

   A  B  C
2  3  6  9
1  2  5  8
0  1  4  7

In [45]:
# concat
df2 = pd.DataFrame([[10,11,12]])
df2.columns = ['A', 'B', 'C']
df3 = pd.concat([df, df2], axis=0)
df3

    A   B   C
0   1   4   7
1   2   5   8
2   3   6   9
0  10  11  12

In [56]:
df2 = pd.DataFrame([[10], [12], [13]])
df2.columns = ['D']
df3 = pd.concat([df, df2], axis=1)
df3

   A  B  C   D
0  1  4  7  10
1  2  5  8  12
2  3  6  9  13